lizhi98/SmartCar_RT1064/MCXVision/libraries/mcxn947_dfp/components/pf1550/fsl_pf1550.h
/*! @brief PF1550 Vsnvs Coin Cell Charging Voltage Attribute definition. */
typedef enum _pf1550_coin_cell_charging_voltage
{
    kPF1550_CoinCellChargingVoltage_1V8 = 0x0U, /* Coin cell charger charging voltage 1.8V. */
    kPF1550_CoinCellChargingVoltage_1V9 = 0x1U, /* Coin cell charger charging voltage 1.9V. */
    kPF1550_CoinCellChargingVoltage_2V  = 0x2U, /* Coin cell charger charging voltage 2.0V. */
    kPF1550_CoinCellChargingVoltage_2V1 = 0x3U, /* Coin cell charger charging voltage 2.1V. */
    kPF1550_CoinCellChargingVoltage_2V2 = 0x4U, /* Coin cell charger charging voltage 2.2V. */
    kPF1550_CoinCellChargingVoltage_2V3 = 0x5U, /* Coin cell charger charging voltage 2.3V. */
    kPF1550_CoinCellChargingVoltage_2V4 = 0x6U, /* Coin cell charger charging voltage 2.4V. */
    kPF1550_CoinCellChargingVoltage_2V5 = 0x7U, /* Coin cell charger charging voltage 2.5V. */
    kPF1550_CoinCellChargingVoltage_2V6 = 0x8U, /* Coin cell charger charging voltage 2.6V. */
    kPF1550_CoinCellChargingVoltage_2V7 = 0x9U, /* Coin cell charger charging voltage 2.7V. */
    kPF1550_CoinCellChargingVoltage_2V8 = 0xAU, /* Coin cell charger charging voltage 2.8V. */
    kPF1550_CoinCellChargingVoltage_2V9 = 0xBU, /* Coin cell charger charging voltage 2.9V. */
    kPF1550_CoinCellChargingVoltage_3V  = 0xCU, /* Coin cell charger charging voltage 3.0V. */
    kPF1550_CoinCellChargingVoltage_3V1 = 0xDU, /* Coin cell charger charging voltage 3.1V. */
    kPF1550_CoinCellChargingVoltage_3V2 = 0xEU, /* Coin cell charger charging voltage 3.2V. */
    kPF1550_CoinCellChargingVoltage_3V3 = 0xFU, /* Coin cell charger charging voltage 3.3V. */
} pf1550_coin_cell_charging_voltage_t;

/*! @brief PF1550 Switch Attribute Structure definition. */
typedef struct _pf1550_switch_attribute
{
    pf1550_switch_dvs_speed_t dvsSpeed;                       /* Switch DVS Speed Selection. */
    pf1550_switch_current_limit_t currentLimit;               /* Switch Current Limit Selection. */
    pf1550_regulator_power_down_sequence_t powerDownSequence; /* The power down sequencer performs the functional
                                                                 opposite to the power up sequencer. */
    bool enableLowPowerMode;      /* Lets the buck enter low power mode during Standby and Sleep. */
    bool enableForcedPwm;         /* Forced in PWM mode irrespective of load current. */
    bool enableForcedPwmInDvs;    /* Forces to track the DVS reference while it is falling. */
    bool enableDischargeResistor; /* Enables discharge resistor on output when regulator disabled. */
} pf1550_switch_attribute_t;

/*! @brief PF1550 LDO Attribute Structure definition. */
typedef struct _pf1550_ldo_attribute
{
    pf1550_regulator_power_down_sequence_t powerDownSequence; /* The power down sequencer performs the functional
                                                                 opposite to the power up sequencer. */
    bool enableLowPowerMode; /* Lets LDO enter low power mode during Standby and Sleep. */
    bool enableLoadSwitch;   /* Set LDO to a load switch (fully on) mode.
                                Changing from true to false is not allowed. */
} pf1550_ldo_attribute_t;

/*! @brief PF1550 Vrefddr Attribute Structure definition. */
typedef struct _pf1550_vrefddr_attribute
{
    pf1550_regulator_power_down_sequence_t powerDownSequence; /* The power down sequencer performs the functional
                                                                 opposite to the power up sequencer. */
} pf1550_vrefddr_attribute_t;

/*! @brief PF1550 Vsnvs Attribute Structure definition. */
typedef struct _pf1550_vsnvs_attribute
{
    pf1550_coin_cell_charging_voltage_t coinCellChargingVoltage; /* Vsnvs Coin Cell Charging Voltage Selection. */
    bool enableLocalBandgapInCoinCellMode;                       /* Enable bandgap in coin cell mode. */
    bool enableCoinCellCharger;                                  /* Enable Coin Cell Charger. */
} pf1550_vsnvs_attribute_t;

/*! @brief PF1550 ONKEY Pad Attribute Structure definition. */
typedef struct _pf1550_onkey_attribute
{
    pf1550_onkey_debounce_t debounce;        /* ONKEY Push Debounce Time Selection. */
    pf1550_onkey_push_reset_time_t pushTime; /* ONKEY Push Reset Time Selection. */
    bool enableTurnOffSystemViaOnkey;        /* Enables turning off of system via ONKEY. */
} pf1550_onkey_attribute_t;

/*! @brief PF1550 PWRON Pad Attribute Structure definition. */
typedef struct _pf1550_power_on_attribute
{
    pf1550_power_on_debounce_t debounce;  /* Power On Pad Debounce Time Selection. */
    bool longPressGoToRegsDisableOrSleep; /* Enables going to REGS_DISABLE or Sleep mode when
                                             PWRON_CFG = 1. Refer to state machine for details. */
    bool longPressRestartToRunStauts;     /* Enables restart of system when PWRON push button is
                                             held low for 5 seconds. */
} pf1550_power_on_attribute_t;

/*! @brief PF1550 STANDBY Pad Attribute Structure definition. */
typedef struct _pf1550_standby_attribute
{
    pf1550_standby_delay_t standbyDelay;       /* Select delay of Standby pin (after synchronization). */
    pf1550_standby_polarity_t standbyPolarity; /* Standby Pad Active Polarity Selection. */
} pf1550_standby_attribute_t;

/*! @brief PF1550 Handle definition. */
typedef struct _pf1550_handle
{
    /* Pointer to the user-defined I2C Send Data function. */
    status_t (*I2C_SendFunc)(
        uint8_t deviceAddress, uint32_t subAddress, uint8_t subAddressSize, const uint8_t *txBuff, uint8_t txBuffSize);
    /* Pointer to the user-defined I2C Receive Data function. */
    status_t (*I2C_ReceiveFunc)(
        uint8_t deviceAddress, uint32_t subAddress, uint8_t subAddressSize, uint8_t *rxBuff, uint8_t rxBuffSize);
    /* The I2C Slave Address Read From OTP. */
    uint8_t slaveAddress;
} pf1550_handle_t;

/*! @brief PF1550 Configuration Structure definition. */
typedef struct _pf1550_config
{
    /* Pointer to the user-defined I2C Send Data function. */
    status_t (*I2C_SendFunc)(
        uint8_t deviceAddress, uint32_t subAddress, uint8_t subAddressSize, const uint8_t *txBuff, uint8_t txBuffSize);
    /* Pointer to the user-defined I2C Receive Data function. */
    status_t (*I2C_ReceiveFunc)(
        uint8_t deviceAddress, uint32_t subAddress, uint8_t subAddressSize, uint8_t *rxBuff, uint8_t rxBuffSize);
    /* Undervoltage Detection Threshold Selection. */
    pf1550_undervoltage_detect_threshold_t threshold;
    /* Power Up Delay Time Selection. */
    pf1550_power_up_delay_t delay;
    /* Shuts down LDO if it enters a current limit fault. Controls LDO1, LDO2 and LDO3. */
    bool shutDownLdoInCurrentFault;
    /* The PF1550 I2C Slave Address. */
    uint8_t slaveAddress;
} pf1550_config_t;

/*!
 * @addtogroup pf1550
 * @{
 */

